In [1]:
import pandas as pd
import numpy as np

df1=pd.DataFrame({"Class1":[95,92,98,100],
                  "Class2":[91,93,97,99]})

df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [3]:
df2=pd.DataFrame({"Class1":[87,89],
                  "Class2":[85,90]})

df2

   Class1  Class2
0      87      85
1      89      90

In [6]:
pd.concat([df1,df2])

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [8]:
df3=pd.DataFrame({"Class1":[96,83]})
df3

   Class1
0      96
1      83

In [9]:
df4=pd.DataFrame({"Class3":[93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [10]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [11]:
df4=pd.DataFrame({"Class3":[93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [12]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [13]:
index_label=['a','b','c','d']
df1a=pd.DataFrame({'Class1':[95,92,98,100],
                   'Class2':[91,93,97,99]},index=index_label)
df4a=pd.DataFrame({'Class3':[93,91,95,98]},index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [14]:
df5=pd.DataFrame({"Class4":[82,92]})
df5

   Class4
0      82
1      92

In [15]:
df_A_B=pd.DataFrame({"판매월":['1월','2월','3월','4월'],
                     "제품A":[100,150,100,130],
                     "제품B":[90,110,140,170]})

df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  100  140
3  4월  130  170

In [16]:
df_C_D=pd.DataFrame({"판매월":["1월","2월","3월","4월"],
                     "제품C":[112,141,203,134],
                     "제품D":[90,110,140,170]})

df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [17]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  100  140  203  140
3  4월  130  170  134  170

In [18]:
df_left=pd.DataFrame({'key':['A','B','C'],'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [19]:
df_right=pd.DataFrame({'key':['A','B','D'],'right':[4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [20]:
df_left.merge(df_right,how='left',on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [21]:
df_left.merge(df_right,how='right',on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [22]:
df_left.merge(df_right,how="outer",on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [23]:
df_left.merge(df_right,how='inner',on='key')

  key  left  right
0   A     1      4
1   B     2      5